greeting = {1: 'Salom', 2: 'Приветствие'}
menu_main = {1: {1: 'Atomy haqida', 
                 2: 'Atomy produksiyasi haqida', 
                 3: 'Atomy bilan biznes', 
                 4: 'Atomy hamkoriga aylanish'},
             2: {1: 'О компании Atomy',
                 2: 'О продукции компании', 
                 3: 'О бизнесе с Atomy',
                 4: 'Стать партнером Atomy'}
            }
about = {1: """😇КОРОТКО О КОМПАНИИ АТОМИ

В мировой экономике существует 3 варианта продвижения продуктов от производителей к конечному потребителю:

1️⃣ ТРАДИЦИОННО-РЕКЛАМНЫЙ - через розничные магазины и торговые центры.

2️⃣ ИНТЕРНЕТ ТОРГОВЛЯ – типа Amazon, Ali-Express, Wish и другие.

3️⃣ ПРЯМЫЕ ПРОДАЖИ ���– так называемый МЛМ или Сетевой Маркетинг. Только этот вариант основан на честной рекламе через существующих клиентов и допускает участие в бизнесе всех желающих.

👌 АТОМИ считается МЛМ компанией, но без традиционных недостатков Сетевого Маркетинга. Это единственная в мире компания, у которой между фабрикой и клиентами нет НИ ОДНОГО ПОСРЕДНИКА!

👌 Даже бизнес партнеры Атоми не являются посредниками, так как цены для новых клиентов такие же как и для дистрибьюторов.

👌 ВЫСШЕЕ КАЧЕСТВО ТОВАРОВ ➕ НИКАКИХ ЦЕНОВЫХ НАКРУТОК 🟰
ЭТО И ЕСТЬ ОДИН ИЗ СЕКРЕТОВ УСПЕХА АТОМИ!

❓ Детальную информации можно найти в разделе ВОПРОСЫ-ОТВЕТЫ.""",
         2: """😇КОРОТКО О КОМПАНИИ АТОМИ

В мировой экономике существует 3 варианта продвижения продуктов от производителей к конечному потребителю:

1️⃣ ТРАДИЦИОННО-РЕКЛАМНЫЙ - через розничные магазины и торговые центры.

2️⃣ ИНТЕРНЕТ ТОРГОВЛЯ – типа Amazon, Ali-Express, Wish и другие.

3️⃣ ПРЯМЫЕ ПРОДАЖИ 👌– так называемый МЛМ или Сетевой Маркетинг. Только этот вариант основан на честной рекламе через существующих клиентов и допускает участие в бизнесе всех желающих.

👌 АТОМИ считается МЛМ компанией, но без традиционных недостатков Сетевого Маркетинга. Это единственная в мире компания, у которой между фабрикой и клиентами нет НИ ОДНОГО ПОСРЕДНИКА!

👌 Даже бизнес партнеры Атоми не являются посредниками, так как цены для новых клиентов такие же как и для дистрибьюторов.

👌 ВЫСШЕЕ КАЧЕСТВО ТОВАРОВ ➕ НИКАКИХ ЦЕНОВЫХ НАКРУТОК 🟰
ЭТО И ЕСТЬ ОДИН ИЗ СЕКРЕТОВ УСПЕХА АТОМИ!

❓ Детальную информации можно найти в разделе ВОПРОСЫ-ОТВЕТЫ."""}

menu_main_desc = {2: """ ➡️ Вы находитесь в ГЛАВНОМ МЕНЮ, в котором всего лишь 4 кнопки, которые приведут вас к четыр��м компактным инфо-блокам!

Возможно, что Вам вполне хватит этой информации для принятия решения. Но.... если у Вас возникнет чувство информационного голода, обратите внимание, что в конце каждого раздела есть кнопка ВОПРОСЫ-ОТВЕТЫ, которая полностью удовлетворит вас всей необходимой информацией

Это, контакты моего владельца:

@NargizaNice

😍Он всегда сможет помочь Вам, ответить на вопросы, если на них не смог ответить я)

Выбирайте с чего мне начать:
⬇️⬇️⬇️""",
                  1: """ ➡️ Вы находитесь в ГЛАВНОМ МЕНЮ, в котором всего лишь 4 кнопки, которые приведут вас к четырем компактным инфо-блокам!

Возможно, что Вам вполне хватит этой информации для принятия решения. Но.... если у Вас возникнет чувство информационного голода, обратите внимание, что в конце каждого раздела есть кнопка ВОПРОСЫ-ОТВЕТЫ, которая полностью удовлетворит вас всей необходимой информацией

Это, контакты моего владельца:

@NargizaNice

😍Он всегда сможет помочь Вам, ответить на вопросы, если на них не смог ответить я)

Выбирайте с чего мне начать:
⬇️⬇️⬇️"""}

main_btn = {1: 'Bosh menyu', 2: 'Главное меню'}

faq_menu = {1: 'Savol va javoblar',
            2: 'Вопросы и ответы'}

faq_about_desc = {1: """Sizning savollaringizga javoblar tayyorladik)
Faqatgina keraklisini tanlang va ma'lumot oling""", 
                  2: """Я подготовил для вас ответы на часто задаваемые вопросы)  
Просто выберите и я вам все расскажу"""}
faq_about_menu = {1: {1: 'ATOMY QANCHALIK MUVAFFAQQIYATLI?', 2: 'MUVAFFAQQIYATNING ASOSIY SABABI NIMA?',
                      3: 'ATOMY MAHSULOTINI KIM REKLAMA QILADI?', 4: 'ATOMY NI QAYSI DAVLATLARDA YURITISH MUMKIN?',
                      5: 'ATOMY BILAN TANISHUVNING FOYDASI NIMA?', 6: 'ATOMY BOSHQA KOMPANIYALARDAN NEGA YAXSHIROQ?',
                      7: 'BOSH MENYU'},
                  2: {1: 'НАСКОЛЬКО УСПЕШНАЯ ATOMY?', 2: 'КАКОВА ОСНОВНАЯ ПРИЧИНА УСПЕХА ATOMY?',
                      3: 'КТО РЕКЛАМИРУЕТ ПРОДУКЦИЮ ATOMY?', 4: 'В КАКИХ СТРАНАХ МОЖНО ПРОДВИГАТЬ ATOMY?',
                      5: 'КАКОВА ПОЛЬЗА ОТ ЗНАКОМСТВА С ATOMY?', 6: 'ЧЕМ ATOMY ЛУЧШЕ ДРУГИХ МЛМ КОМПАНИЙ?',
                      7: 'Главное меню'}}

about_prod_desc = {1: 'Produksiya haqida qisqa ma\'lumot...',
                   2: 'Краткая информация о продукции'}

menu_back = {1: {1: 'Ortga', 2: 'Bosh menyu'},
             2: {1: 'Шаг назад', 2: 'Главное меню'}}

# todo: add photos 1-2-6
faq_answers = {2: {1: """😍 НАСКОЛЬКО УСПЕШНА АТОМИ?
https://jamabucket.s3.us-east-2.amazonaws.com/telegram+bot+files/img/misc/img_prod.jpg
Среди более чем 500 известных МЛМ компаний Атоми является единственной, которая не только достигла заветный годовой оборот в 1 миллиард долларов уже на 8-й год в бизнесе 🚀, но удвоила его за следующие 4 года.
*
Это не удалось ��и одной друг��й сетевой компании за 60 лет существования индустрии Прямых Продаж!""",
                   2: """КАКОВА ОСНОВНАЯ ПРИЧИНА УСПЕХА АТОМИ?

Основной причиной мирового успеха Атоми является простая, но гениальная бизнес идея, в которой всего лишь 4 слова:

АБСОЛЮТНОЕ КАЧЕСТВО – АБСОЛЮТНАЯ ЦЕНА

Цель - сделать товары Премиум Класса доступыми массовому покупателю! Так появилось новое слово МАССТИЖ = МАССовый + ПресТИЖный.

👌АБСОЛЮТНОЕ КАЧЕСТВО означает, что линейка продуктов Атоми состоит только из товаров ПРЕМИУМ КЛАССА.
*
👌АБСОЛЮТНАЯ ЦЕНА означает, что ни одна другая компания на рынке, предлагающая товары аналогичного КАЧЕСТВА, не может конкурировать с Атоми по предельно низким ценам.
*
Сегодня, покупая для себя различные товары Атоми, мы точно знаем, что найти лучшую цену в других компаниях на продукцию ТАКОГО ЖЕ КАЧЕСТВА практически НЕВОЗМОЖНО! Атоми сумела соединить в себе нечто несоединимое – ВЫСОКОЕ КАЧЕСТВО И ОТНОСИТЕЛЬНО НИЗКУЮ ЦЕНУ. 👌""",
                   3: """✅ КТО РЕКЛАМИРУЕТ ПРОДУКТЫ АТОМИ?


👌 Атоми ИСПОЛЬЗУЕТ БЕЗРЕКЛАМНУЮ ТЕХНОЛОГИЮ приобретения новых клиентов - И ЭТО ОЧЕНЬ ВАЖНО! Компания не тратит ни копейки средств на рекламу своей продукции, предлагая это делать тем, кто уже успел влюбиться в продукцию Атоми.

👌 Кто-то рекламирует товары Атоми по доброте душевной - просто потому что трудно молчать, когда пользуешься чем-то очень хорошим, чего нельзя купить ни в одном магазине.

👌 Кто-то осознанно присоединяется к РЕФЕРАЛЬНОЙ ПРОГРАММЕ, потому что Атоми выделяет 70% от своей еженедельной прибыли на поощрение такой деятельности.

❗️Детали о возможностях дополнительного заработка с Атоми или профессионального участия в Карьерном Росте Вы можете найти в разделе «ЗАРАБОТОК С АТОМИ»""",
                   4: """🌐 В КАКИХ СТРАНАХ МОЖНО ПРОДВИГАТЬ АТОМИ?


🔸 В отличие от большинства всемирно известных торговых площадок компания Атоми создает свою инфраструктуру в каждой отдельно взятой стране, чтобы обеспечить доставку купленных товаров в считанные дни.

🔹 На начало 2023 года Атоми открыла филиалы и склады уже для 58 стран, верифицируя свою продукцию в этих странах, что освобождает покупателей от любой формы таможенных сборов.

Вот открытые для бизнеса страны:

🔸 ASIA PACIFIC – ВОСТОЧНЫЙ РЕГИОН
Australia, Cambodia, Hong Kong, India, Indonesia, Japan, Kazakhstan, Kyrgyzstan, Malaysia, Mongolia, New Zealand, Philippines, Russia, Singapore, Taiwan, Thailand, Uzbekistan

🔹 NORTH & LATIN AMERICA – СЕВЕРНАЯ И ЮЖНАЯ АМЕРИКА
Canada, USA, Mexico, Columbia, Brazil

🔸 EUROPE - ЕВРОПА
Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Russia, Slovakia, Slovenia, Spain, Sweden, Switzerland, Turkey, United Kingdom

🔹 Единый ID номер и единая система учета покупок в реальном времени позволяют каждому партнеру развивать международный бизнес во всех указанных странах.

🔸 Еще 32 страны находятся в режиме предрегистрации. Вот они:
Argentina, Armenia, Azerbaijan, Bangladesh, Bolivia, Botswana, Brunei, Chile, Costa Rica, Dominican Republic, Ecuador, El Salvador, Georgia, Guatemala, Haiti, Israel, Macau, Moldova, Namibia, Nepal, Nigeria, Panama, Paraguay, Peru, South Africa, Sri Lanka, Tajikistan, Turkmenistan, UAE, Ukraine.

В этих странах можно зарегистрироваться в качестве клиента Атоми, можно создавать свою международную структуру, но пока еще нельзя получать комиссионные до официального открытия этих стран.""",
                   5: """КАКОВА ПОЛЬЗА ОТ ЗНАКОМСТВА С АТОМИ?

Есть несколько возможных вариантов:

1️⃣ Можно стать клиентом Атоми! Регистрация совершенно бесплатная! Атоми предлагает продукцию повседневного спроса ВЫСОКОГО КАЧЕСТВА по относительно НИЗКИМ ЦЕНАМ. Вы получите огромное удовольствие от каждой приходящей посылки с эксклюзивными продуктами Премиум Класса, которых нет ни в одном магазине вашего города.

2️⃣ Став клиентом, можно нацелиться на Дополнительный Доход без отвлечения от основной работы, используя удобную и чрезвычайно мягкую Реферальную Программу Атоми - НИКАКИХ ОБЯЗАТЕЛЬНЫХ ПОКУПОК!

3️⃣ Профессиональный вариант выбирают те, кто мечтают создать для себя источник Пассивного Дохода. Это когда заработок поступает 24 часа в сутки. Особенность серьезного бизнеса с Атоми состоит также в том, что для него не нужны никакие инвестиции.

ВАЖНО! - Благодаря предельно низким ценам на продукцию Премиум Класса сеть постоянных клиентов непрерывно растет. Многие из них пользуются продукцией Атоми даже не месяцы, а годы, что в свою очередь обеспечивает максимально стабильный Пассивный Доход для профессионалов - независимых партнеров Атоми во всем мире.""",
                   6: """ЧЕМ АТОМИ ЛУЧШЕ ДРУГИХ МЛМ КОМПАНИЙ? 

❤️ Настолько лучше, что Атоми даже нельзя назвать МЛМ компанией, в традиционном смысле этого слова, несмотря на то, что она находится в мировых списках наиболее преуспевающих МЛМ компаний?

🧡 Почему?

– Потому что в Атоми нет ни одного признака МЛМ бизнеса. Просто посмотрите на вот эту картинку – и все станет ясным.💛 Особое восхищение вызывает последний пункт, который присутствует во всех МЛМ компаниях кроме Атоми. Многие даже не верят, что такое возможно в МЛМ бизнесе!  
💚 Что же в Атоми осталось от МЛМ бизнеса? – Только то, ради чего в него и приходят! – Возможность создать для себя непрерывный, автоматически поступающий Пассивный Доход. Тот самый доход, о котором сказал когда-то один из самых богатых американцев - Уоррен Баффет:"""
                   },
               1: {1: """😍 НАСКОЛЬКО УСПЕШНА АТОМИ?

Среди более чем 500 известных МЛМ компаний Атоми является единственной, которая не только достигла заветный годовой оборот в 1 миллиард долларов уже на 8-й год в бизнесе 🚀, но удвоила его за следующие 4 года.
*
Это не удалось ни одной другой сетевой компании за 60 лет существования индустрии Прямых Продаж!""",
                   2: """КАКОВА ОСНОВНАЯ ПРИЧИНА УСПЕХА АТОМИ?

Основной причиной мирового успеха Атоми является простая, но гениальная бизнес иде��, в которой всего лишь 4 слова:

АБСОЛЮТНОЕ КАЧЕСТВО – АБСОЛЮТНАЯ ЦЕНА

Цель - сделать товары Премиум Класса доступыми массовому покупателю! Так появилось новое слово МАССТИЖ = МАССовый + ПресТИЖный.

👌АБСОЛЮТНОЕ КАЧЕСТВО означает, что линейка продуктов Атоми состоит только из товаров ПРЕМИУМ КЛАССА.
*
👌АБСОЛЮТНАЯ ЦЕНА означает, что ни одна другая компания на рынке, предлагающая товары аналогичного КАЧЕСТВА, не может конкурировать с Атоми по предельно низким ценам.
*
Сегодня, покупая для себя различные товары Атоми, мы точно знаем, что найти лучшую ��ену в других компаниях на продукцию ТАКОГО ЖЕ КАЧЕСТВА практически НЕВОЗМОЖНО! Атоми сумела соединить в себе нечто несоединимое – ВЫСОКОЕ КАЧЕСТВО И ОТНОСИТЕЛЬНО НИЗКУЮ ЦЕНУ. 👌""",
                   3: """✅ КТО РЕКЛАМИРУЕТ ПРОДУКТЫ АТОМИ?


👌 Атоми ИСПОЛЬЗУЕТ БЕЗРЕКЛАМНУЮ ТЕХНОЛОГИЮ приобретения новых клиентов - И ЭТО ОЧЕНЬ ВАЖНО! Компания не тратит ни копейки средств на рекламу своей продукции, предлагая это делать тем, кто уже успел влюбиться в продукцию Атоми.

👌 Кто-то рекламирует товары Атоми по доброте душевной - просто потому что трудно молчать, когда пользуешься чем-то очень хорошим, чего нельзя купить ни в одном магазине.

👌 Кто-то осознанно присоединяется к РЕФЕРАЛЬНОЙ ПРОГРАММЕ, потому что Атоми выделяет 70% от своей еженедельной прибыли на поощрение такой деятельности.

❗️Детали о возможностях дополнительного заработка с Атоми или профессионального участия в Карьерном Росте Вы можете найти в разделе «ЗАРАБОТОК С АТОМИ»""",
                   4: """🌐 В КАКИХ СТРАНАХ МОЖНО ПРОДВИГАТЬ АТОМИ?


🔸 В отличие от большинства всемирно известных торговых площадок компания Атоми создает свою инфраструктуру в ��аждой отдельно взятой стране, чтобы обеспечить доставку купленных товаров в считанные дни.

🔹 На начало 2023 года Атоми открыла филиалы и склады уже для 58 стран, верифицируя свою продукцию в этих странах, что освобождает покупателей от любой формы таможенных сборов.

Вот открытые для бизнеса страны:

🔸 ASIA PACIFIC – ВОСТОЧНЫЙ РЕГИОН
Australia, Cambodia, Hong Kong, India, Indonesia, Japan, Kazakhstan, Kyrgyzstan, Malaysia, Mongolia, New Zealand, Philippines, Russia, Singapore, Taiwan, Thailand, Uzbekistan

🔹 NORTH & LATIN AMERICA – СЕВЕРНАЯ И ЮЖНАЯ АМЕРИКА
Canada, USA, Mexico, Columbia, Brazil

🔸 EUROPE - ЕВРОПА
Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Russia, Slovakia, Slovenia, Spain, Sweden, Switzerland, Turkey, United Kingdom

🔹 Единый ID номер и единая система учета покупок в реальном времени позволяют каждому партнеру развивать международный бизнес во всех указанных странах.

🔸 Еще 32 страны находятся в режиме предрегистрации. Вот они:
Argentina, Armenia, Azerbaijan, Bangladesh, Bolivia, Botswana, Brunei, Chile, Costa Rica, Dominican Republic, Ecuador, El Salvador, Georgia, Guatemala, Haiti, Israel, Macau, Moldova, Namibia, Nepal, Nigeria, Panama, Paraguay, Peru, South Africa, Sri Lanka, Tajikistan, Turkmenistan, UAE, Ukraine.

В этих странах можно зарегистрироваться в качестве клиента Атоми, можно создавать свою международную структуру, но пока еще нельзя получать комиссионные до официального открытия этих стран.""",
                   5: """КАКОВА ПОЛЬЗА ОТ ЗНАКОМСТВА С АТОМИ?

Есть несколько возможных вариантов:

1️⃣ Можно стать клиентом Атоми! Регистрация совершенно бесплатная! Атоми предлагает продукцию повседневного спроса ВЫСОКОГО КАЧЕСТВА по относительно НИЗКИМ ЦЕНАМ. Вы получите огромное удовольствие от каждой приходящей посылки с эксклюзивными продуктами Премиум Класса, которых нет ни в одном магазине вашего города.

2️⃣ Став клиентом, можно нацелиться на Дополнительный Доход без отвлечения от основной работы, используя удобную и чрезвычайно мягкую Реферальную Программу Атоми - НИКАКИХ ОБЯЗАТЕЛЬНЫХ ПОКУПОК!

3️⃣ Профессиональный вариант выбирают те, кто мечтают создать для себя источник Пассивного Дохода. Это когда заработок поступает 24 часа в сутки. Особенность серьезного бизнеса с Атоми состоит также в том, что для него не нужны никакие инвестиции.

ВАЖНО! - Благодаря предельно низким ценам на продукцию Премиум Класса сеть постоянных клиентов непрерывно растет. Многие из них пользуются продукцией Атоми даже не месяцы, а годы, что в свою очередь обеспечивает максимально стабильный Пассивный Доход для профессионалов - независимых партнеров Атоми во всем мире.""",
                   6: """ЧЕМ АТОМИ ЛУЧШЕ ДРУГИХ МЛМ КОМПАНИЙ? 

❤️ Настолько лучше, что Атоми даже нельзя назвать МЛМ компанией, в традиционном смысле этого слова, несмотря на то, что она находится в мировых списках наиболее преуспевающих МЛМ компаний?

🧡 Почему?

– Потому что в Атоми нет ни одного признака МЛМ бизнеса. Просто посмотрите на вот эту картинку – и все станет ясным.💛 Особое восхищение вызывает последний пункт, который присутствует во всех МЛМ компаниях кроме Атоми. Многие даже не верят, что такое возможно в МЛМ бизнесе!  
💚 Что же в Атоми осталось от МЛМ бизнеса? – Только то, ради чего в него и приходят! – Возможность создать для себя непрерывный, автоматически поступающий Пассивный Доход. Тот самый доход, о котором сказал когда-то один из самых богатых американцев - Уоррен Баффет:"""
                   }
               }
about_prod_menu = {1: {1: 'Kompaniya saytlari', 2: 'Telegram kanal'},
              2: {1: 'Сайты компании', 2: 'Телеграм канал'}}

faq_prod_menu = {1: {1: 'PRODUKSIYANING TAVSIFINI QANDAY KO\'RSA BO\'LADI?',
                     2: 'NARXLARNI YAXSHILIGINI QANDAY BILSA BO\'LADI?',
                     3: 'ZAKAZLARNI YETKAZIB BERISHGA KIM TO\'LAYDI?',
                     4: 'O\'ZBEKISTONDAY QANDAY KLIENT BO\'LISH MUMKIN?'},
                 2: {1: 'КАК ПОСМОТРЕТЬ ОПИСАНИЕ ПРОДУКТОВ?',
                     2: 'КАК УБЕДИТЬСЯ В ХОРОШИХ ЦЕНАХ?',
                     3: 'КТО ПЛАТИТ ЗА ДОСТАВКУ ЗАКАЗОВ?',
                     4: 'КАК СТАТЬ КЛИЕНТОМ В УЗБЕКИСТАНЕ?'
                     }
                 }

sites_desc = {1: "saytlarimiz:",
              2: "Наши сайты:"}

site_urls = ['https://www.atomy.uz/uz/Home/Product/MallMain',
             'https://www.atomy.com/tr/Home/Product/MallMain',
             'https://shop.atomy.com/kr/']

telegram_desc = {1: 'Ko\'proq ma\'lumot olish uchun bizning Telegram kanalimizga kirishingiz mumkin...',
                 2: 'Для получения более подробной и��формации, вы можете перейти на наш канал в Telegram...'}

become_partner = {1:'Atomy hamkoriga aylanish juda ham oson va 5 daqiqa vaqtingizni talab qiladi.\n'
                    'Iltimos, siz bilan bog\'lanishimiz uchun o\'z telefon raqamingizni kiriting\n'
                    'Yoki \"Raqamni jo\'natish\" tugmasini bosishingiz ham mumkin.',
                  2:'Стать партнером Atomy очень просто и займёт не более 5 минут вашего времени. \n'
                    'Оставьте пожалуйста свой контактный номер. чтобы продолжить\n'
                    'Можете ввести номер вручную, либо нажать на кноку \"Отправить номер\".'}

contact_btn = {1: '☎ Raqamni jo\'natish',
               2: '☎ Отправить номер'}

partner_finish = {1: 'Qabul qilindi, siz bilan tez orada bog\'lanamiz.',
                  2: 'Принято, в скором мы свяжемся с вами.'}
